Repository: abd-alrahman-hammad/aqua_connect_flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

source: System Settings
ar: إعدادات النظام

source: ACCOUNT
ar: الحساب

source: Account Security
ar: أمان الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Notification Settings
ar: إعدادات الإشعارات

# alertsAndNotifications
source: Alerts & Notifications
ar: تنبيهات وإشعارات

# hardwareAndIot
source: HARDWARE & IOT
ar: الأجهزة و إنترنت الأشياء

source: WiFi Management
ar: إدارة الواي فاي

source: Run Connection Wizard
ar: تشغيل معالج الاتصال

source: Operating Thresholds
ar: عتبات التشغيل

# thresholdsSubtitle
source: Fan, Heater, pH pump, Feeding pump limits
ar: حدود المروحة، السخان، مضخة الأس الهيدروجيني، مضخة التغذية

source: Sensor Calibration
ar: معايرة المستشعرات

# calibrationSubtitle
source: pH, EC, and Temperature
ar: الأس الهيدروجيني، التوصيل الكهربائي، ودرجة الحرارة

source: Firmware Update
ar: تحديث البرنامج الثابت

# upToDate
source: Up to date: v2.4.1
ar: محدث: v2.4.1

source: APP PREFERENCES
ar: تفضيلات التطبيق

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الداكن

source: Sign Out
ar: تسجيل الخروج

source: Cancel
ar: إلغاء

# signOutConfirmationTitle
source: Sign Out
ar: تسجيل الخروج

# signOutConfirmationMessage
source: Are you sure you want to sign out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Menu
ar: القائمة

source: Analytics
ar: التحليلات

# historyAndTrends
source: History & Trends
ar: التاريخ والاتجاهات

source: AI Insights
ar: رؤى الذكاء الاصطناعي

source: Growth Predictions
ar: توقعات النمو

source: Support
ar: الدعم

# helpAndGuides
source: Help & Guides
ar: المساعدة والإرشادات

source: Real-time Sensors
ar: القراءات الحالية للحساسات

source: ONLINE
ar: متصل

source: OFFLINE
ar: غير متصل

source: VITALITY
ar: الحيوية

source: WELCOME BACK,
ar: مرحبًا بعودتك،

# alertsAndNotificationsTitle
source: Alerts & Notifications
ar: التنبيهات والإشعارات

source: Dismiss
ar: تجاهل

source: UNDO
ar: تراجع

source: All Systems Nominal
ar: جميع الأنظمة تعمل بشكل طبيعي

# noActiveAlerts
source: No active alerts or warnings at this time.
ar: لا توجد تنبيهات أو تحذيرات نشطة في الوقت الحالي.

source: Historical Analytics
ar: التحليلات التاريخية

source: Live
ar: مباشر

source: Stable
ar: مستقر

# noDataAvailable
source: No data available for this period
ar: لا توجد بيانات متاحة لهذه الفترة

# aiInsightsTitle
source: AI Insights
ar: رؤى الذكاء الاصطناعي

source: Analyzing...
ar: جارٍ التحليل...

source: ACTION REQUIRED
ar: إجراء مطلوب

source: DAILY TIP
ar: نصيحة يومية

source: System Critical
ar: النظام في حالة حرجة

source: System Warning
ar: تحذير النظام

source: System Optimal
ar: النظام مثالي

# criticalDescription
source: Low water levels detected. Nutrient balance is severely compromised.
ar: تم اكتشاف انخفاض في مستويات المياه. توازن العناصر الغذائية معرض للخطر بشدة.

# warningDescription
source: Some readings are out of optimal range. Check sensors.
ar: بعض القراءات خارج النطاق المثالي. تحقق من أجهزة الاستشعار.

# optimalDescription
source: All systems are functioning within optimal parameters.
ar: جميع الأنظمة تعمل ضمن المعايير المثالية.

source: pH Level
ar: مستوى الحموضة

source: EC Level
ar: مستوى الأملاح

source: Temperature
ar: درجة الحرارة

source: Water Level
ar: مستوى المياه

source: Waiting for insights...
ar: بانتظار الرؤى...

source: ANALYSIS
ar: التحليل

source: Error loading chart
ar: خطأ في تحميل الرسم البياني

# systemCriticalDescription
source: Low water levels detected. Nutrient balance is severely compromised.
ar: تم اكتشاف انخفاض في مستويات المياه. توازن العناصر الغذائية معرض للخطر بشدة.

# systemWarningDescription
source: Some readings are out of optimal range. Check sensors.
ar: بعض القراءات خارج النطاق المثالي. تحقق من أجهزة الاستشعار.

# systemOptimalDescription
source: All systems are functioning within optimal parameters.
ar: جميع الأنظمة تعمل ضمن المعايير المثالية.

source: Home
ar: الرئيسية

source: Controls
ar: التحكم

source: Vision
ar: الرؤية

source: More
ar: المزيد

source: Settings
ar: الإعدادات

# verifyEmailFirst
source: Please verify your email first.
ar: يرجى تأكيد بريدك الإلكتروني أولاً.

source: Account Confirmed
ar: تم تأكيد الحساب

source: OK
ar: موافق

source: Error
ar: خطأ

# rayyanTitle
source: Rayyan
ar: ريان

# rayyanSubtitle
source: Smart Hydroponics Management
ar: إدارة الزراعة المائية الذكية

source: Email Address
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Verification Sent
ar: تم إرسال التحقق

source: Create Account
ar: إنشاء حساب

# joinFuture
source: Join the future of automated farming
ar: انضم لمستقبل الزراعة الآلية

source: Full Name
ar: الاسم الكامل

# fullNameHint
source: Alex Rivera
ar: أحمد علي

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Reset Link Sent
ar: تم إرسال رابط إعادة التعيين

source: Send Reset Link
ar: إرسال رابط إعادة التعيين

source: Remember me
ar: تذكرني

# pleaseEnterEmail
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# verificationSentMessage
source: We've sent you a verification link to your email. Please check it.
ar: لقد أرسلنا رابط التحقق إلى بريدك الإلكتروني. الرجاء التحقق منه.

# pleaseEnterFullName
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

source: Please enter a password
ar: يرجى إدخال كلمة المرور

# passwordLengthError
source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

# resetPasswordTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordSubtitle
source: Enter your email and we'll send you instructions to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك تعليمات لإعادة تعيين كلمة المرور.

# resetLinkSentMessage
source: A password reset link has been sent to your email address.
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى عنوان بريدك الإلكتروني.

# statusOk
source: OK
ar: جيد

# statusWarning
source: WARNING
ar: تحذير

# statusCritical
source: CRITICAL
ar: حرج

# vitalitySystemOffline
source: System Offline This is the last data received. Please check your connection
ar: النظام غير متصل هذه آخر بيانات تم استلامها. يرجى التحقق من اتصالك

# vitalityWaitingForData
source: Waiting for data...
ar: بانتظار البيانات...

# vitalityCriticalLowWater
source: Critical: Low Water
ar: حرج: انخفاض مستوى الماء

# vitalityLowWater
source: Low Water
ar: انخفاض مستوى الماء

# vitalityTempUnstable
source: Temp Unstable
ar: درجة الحرارة غير مستقرة

# vitalityPhUnstable
source: pH Unstable
ar: الأس الهيدروجيني غير مستقر

# vitalityEcUnstable
source: Ec Unstable
ar: الأملاح غير مستقرة

# vitalitySystemNominal
source: System Nominal
ar: النظام يعمل بكفاءة

# defaultUser
source: User
ar: مستخدم

# celsiusUnit
source: °C
ar: °م

source: Connect to
ar: اتصل بـ

source: Chat with Rayyan
ar: تحدث مع ريان

source: Success
ar: تم بنجاح

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

source: Thresholds saved successfully
ar: تم حفظ الحدود بنجاح

# noUserData
source: No user data found
ar: لم يتم العثور على بيانات المستخدم

# errorSigningOut
source: Error signing out: {error}
ar: خطأ في تسجيل الخروج: {error}

# errorPickingImage
source: Error picking image: {error}
ar: خطأ في اختيار الصورة: {error}

# alertDismissed
source: {title} dismissed
ar: تم تجاهل {title}

# supportAndLearning
source: Support & Learning
ar: الدعم والتعلم

source: Video Guides
ar: دروس فيديو

# visualWalkthroughs
source: Visual walkthroughs for your system
ar: شروحات مرئية لنظامك

# settingUpReservoir
source: Setting up your Reservoir
ar: إعداد الخزان

# nutrientMixingGuide
source: Automated nutrient mixing guide
ar: دليل خلط المغذيات الآلي

source: Search Results
ar: نتائج البحث

source: Frequently Asked Questions
ar: الأسئلة الشائعة

# searchFaqsHint
source: Search FAQs...
ar: ابحث في الأسئلة الشائعة...

source: No results found.
ar: لم يتم العثور على نتائج.

# faqQuestion1
source: What is the ideal pH range?
ar: ما هو نطاق الأس الهيدروجيني المثالي؟

# faqAnswer1
source: For most hydroponic plants, keep the pH between 5.5 and 6.5. Regular testing is essential for nutrient uptake.
ar: بالنسبة لمعظم النباتات المائية، حافظ على الأس الهيدروجيني بين 5.5 و 6.5. الفحص المنتظم ضروري لامتصاص المغذيات.

# faqQuestion2
source: How do I maintain my pump?
ar: كيف أحافظ على المضخة؟

# faqAnswer2
source: Clean your pump monthly to prevent clogging. Ensure it is fully submerged at all times to avoid overheating.
ar: نظّف المضخة شهرياً لمنع الانسداد. تأكد من غمرها بالكامل في جميع الأوقات لتجنب ارتفاع الحرارة.

# faqQuestion3
source: What is the best lighting schedule?
ar: ما هو أفضل جدول للإضاءة؟

# faqAnswer3
source: Leafy greens typically need 14-16 hours of light daily. Fruiting plants may require more specific cycles.
ar: تحتاج الخضروات الورقية عادةً إلى 14-16 ساعة من الضوء يومياً. قد تتطلب نباتات الفاكهة دورات أكثر تحديداً.

# faqQuestion4
source: How should I mix nutrients?
ar: كيف يجب أن أمزج المغذيات؟

# faqAnswer4
source: Always add nutrients to water, never mix them directly. Follow the order: Micro, Grow, then Bloom.
ar: أضف المغذيات دائماً إلى الماء، ولا تمزجها مباشرة. اتبع الترتيب: مايكرو، ثم جرو، ثم بلوم.

# faqQuestion5
source: How do I enable app notifications?
ar: كيف أفعّل إشعارات التطبيق؟

# faqAnswer5
source: Go to Settings > Notifications to enable alerts for critical metrics like low water levels or pH imbalance.
ar: انتقل إلى الإعدادات > الإشعارات لتفعيل التنبيهات للمقاييس الحرجة مثل انخفاض مستوى الماء أو اختلال الأس الهيدروجيني.

# faqQuestion6
source: What is the ideal water temperature?
ar: ما هي درجة حرارة الماء المثالية؟

# faqAnswer6
source: Maintain water temperature between 65°F and 70°F (18°C - 21°C). Too warm can lead to root rot; too cold slows growth.
ar: حافظ على درجة حرارة الماء بين 18 و 21 درجة مئوية. الحرارة الزائدة قد تسبب تعفن الجذور؛ والبرودة الشديدة تبطئ النمو.

# faqQuestion7
source: Why are my plant leaves turning yellow?
ar: لماذا تتحول أوراق نباتاتي إلى اللون الأصفر؟

# faqAnswer7
source: Yellow leaves often indicate nutrient deficiency (usually Nitrogen) or pH imbalance blocking nutrient uptake.
ar: غالباً ما تشير الأوراق الصفراء إلى نقص المغذيات (عادةً النيتروجين) أو اختلال الأس الهيدروجيني الذي يمنع امتصاص المغذيات.

# faqQuestion8
source: How far apart should I space my plants?
ar: ما هي المسافة المناسبة بين النباتات؟

# faqAnswer8
source: Space lettuce and herbs 6-8 inches apart. Larger fruiting plants like tomatoes need 12-18 inches of space.
ar: باعد بين الخس والأعشاب 15-20 سم. تحتاج النباتات المثمرة الأكبر مثل الطماطم إلى 30-45 سم.

# faqQuestion9
source: How often should I clean the system?
ar: كم مرة يجب تنظيف النظام؟

# faqAnswer9
source: Perform a full system flush and cleaning every 2-3 weeks to prevent algae buildup and salt accumulation.
ar: قم بتنظيف وشطف النظام بالكامل كل 2-3 أسابيع لمنع تراكم الطحالب وتجمع الأملاح.

# accountSecurityTitle
source: Account Security
ar: أمان الحساب

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# pleaseEnterCurrentPassword
source: Please enter your current password
ar: يرجى إدخال كلمة المرور الحالية

# pleaseEnterNewPassword
source: Please enter a new password
ar: يرجى إدخال كلمة مرور جديدة

# passwordMinLength
source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

# pleaseConfirmPassword
source: Please confirm your new password
ar: يرجى تأكيد كلمة المرور الجديدة

# passwordsMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Updating...
ar: جارٍ التحديث...

# updatePasswordButton
source: Update Password
ar: تحديث كلمة المرور

source: Something went wrong
ar: حدث خطأ ما

# sensorCalibrationTitle
source: Sensor Calibration
ar: معايرة المستشعرات

# logLabel
source: Log
ar: السجل

# calibrationInfoMessage
source: For accurate readings, calibrate sensors monthly using standard buffer solutions.
ar: للحصول على قراءات دقيقة، قم بمعايرة المستشعرات شهرياً باستخدام محاليل معيارية.

source: pH Sensor
ar: مستشعر الأس الهيدروجيني

source: EC Sensor
ar: مستشعر التوصيل الكهربائي

source: Current: {value}
ar: الحالي: {value}

# lastCalibration
source: Last: {time}
ar: آخر: {time}

source: Calibrate Now
ar: معايرة الآن

# daysAgo2
source: 2 days ago
ar: منذ يومين

# daysAgo5
source: 5 days ago
ar: منذ 5 أيام

# operatingThresholdsTitle
source: Operating Thresholds
ar: عتبات التشغيل

# thresholdsInfoMessage
source: These limits control when fans, heaters, and pumps operate automatically.
ar: تتحكم هذه الحدود في وقت تشغيل المراوح والسخانات والمضخات تلقائياً.

# fanLimitHighLabel
source: Fan Limit (temp_high)
ar: حد المروحة (temp_high)

# fanLimitHighHint
source: °C - Fan operating limit
ar: °م - حد تشغيل المروحة

# heaterLimitLowLabel
source: Heater Limit (temp_low)
ar: حد السخان (temp_low)

# heaterLimitLowHint
source: °C - Heater operating limit
ar: °م - حد تشغيل السخان

# phHighLimitLabel
source: pH Pump Limit (ph_high)
ar: حد مضخة pH (ph_high)

# phHighLimitHint
source: pH - pH pump operating limit
ar: pH - حد تشغيل مضخة pH

# phLowLimitLabel
source: pH Pump Limit (ph_low)
ar: حد مضخة pH (ph_low)

# phLowLimitHint
source: pH - pH lower bound
ar: pH - الحد الأدنى لـ pH

# ecHighLimitLabel
source: Feeding Pump Limit (ec_high)
ar: حد مضخة التغذية (ec_high)

# ecHighLimitHint
source: mS/cm - Feeding pump off limit
ar: mS/cm - حد إيقاف مضخة التغذية

# ecLowLimitLabel
source: Feeding Pump Limit (ec_low)
ar: حد مضخة التغذية (ec_low)

# ecLowLimitHint
source: mS/cm - Feeding pump operating limit
ar: mS/cm - حد تشغيل مضخة التغذية

source: Save Thresholds
ar: حفظ الحدود

# phCalibrationTitle
source: pH Calibration
ar: معايرة الأس الهيدروجيني

source: Current Reading
ar: القراءة الحالية

source: Signal Stable
ar: الإشارة مستقرة

source: Calibration Wizard
ar: معالج المعايرة

# prepareBuffer7
source: Prepare Buffer 7.0
ar: تحضير المحلول المعياري 7.0

# prepareBuffer7Sub
source: Clean probe with distilled water and place in pH 7.0 solution.
ar: نظّف المسبار بالماء المقطر وضعه في محلول pH 7.0.

# prepareBuffer4
source: Prepare Buffer 4.0
ar: تحضير المحلول المعياري 4.0

# prepareBuffer4Sub
source: Rinse probe again and place in pH 4.0 solution.
ar: اشطف المسبار مرة أخرى وضعه في محلول pH 4.0.

# finalizeCalibration
source: Finalize
ar: إنهاء

# finalizeCalibrationSub
source: Save new calibration data to flash memory.
ar: حفظ بيانات المعايرة الجديدة في الذاكرة.

# calibratePoint7
source: Calibrate Point 7.0
ar: معايرة النقطة 7.0

# calibratePoint4
source: Calibrate Point 4.0
ar: معايرة النقطة 4.0

source: Save Calibration
ar: حفظ المعايرة

# ecCalibrationTitle
source: EC Calibration
ar: معايرة التوصيل الكهربائي

source: Current Conductivity
ar: التوصيل الكهربائي الحالي

# ecProbeWarning
source: Ensure the probe is clean and free of organic buildup before calibrating.
ar: تأكد من أن المسبار نظيف وخالٍ من التراكم العضوي قبل المعايرة.

source: Calibration Standard
ar: المعيار القياسي

# calibrationStandardValue
source: 1.413 mS/cm (Standard)
ar: 1.413 mS/cm (قياسي)

# tempCompensation
source: Temperature Compensation
ar: تعويض الحرارة

# tempCompensationValue
source: 2.0% / °C
ar: 2.0% / °م

# fixedLabel
source: Fixed
ar: ثابت

# startOnePointCalibration
source: Start 1-Point Calibration
ar: بدء معايرة النقطة الواحدة

# tempCalibrationTitle
source: Temp Calibration
ar: معايرة الحرارة

source: Sensor Reading
ar: قراءة المستشعر

# rawValue
source: Raw Value: {value}°C
ar: القراءة الخام: {value}°م

source: Manual Offset Adjustment
ar: ضبط الإزاحة اليدوي

# offsetInstructions
source: Use a certified reference thermometer to determine the offset required.
ar: استخدم مقياس حرارة مرجعي معتمد لتحديد الإزاحة المطلوبة.

# offsetLabel
source: OFFSET °C
ar: الإزاحة °م

source: Apply Offset
ar: تطبيق الإزاحة

# firmwareUpdateTitle
source: Firmware Update
ar: تحديث البرنامج الثابت

# systemUpToDate
source: System is Up to Date
ar: النظام محدث

# installedVersion
source: Installed Version: {version}
ar: الإصدار المثبت: {version}

# changelogTitle
source: Changelog {version}
ar: سجل التغييرات {version}

# releasedDate
source: Released Oct 24, 2023
ar: صدر في 24 أكتوبر 2023

# changelogItem1
source: Improved pH sensor stability algorithm
ar: تحسين خوارزمية استقرار مستشعر pH

# changelogItem2
source: New "Eco Mode" for lighting schedule
ar: وضع "التوفير" الجديد لجدول الإضاءة

# changelogItem3
source: Bug fixes for WiFi reconnection logic
ar: إصلاح أخطاء في منطق إعادة اتصال WiFi

source: Check for Updates
ar: التحقق من التحديثات

# notificationSettingsTitle
source: Notification Settings
ar: إعدادات الإشعارات

source: Push Notifications
ar: الإشعارات الفورية

# pushNotificationsSub
source: Enable or disable all notifications
ar: تفعيل أو تعطيل جميع الإشعارات

# alertsAndWarningsSection
source: ALERTS & WARNINGS
ar: التنبيهات والتحذيرات

source: Critical System Failures
ar: أعطال النظام الحرجة

# criticalSystemFailuresSub
source: Pump failure, leak detection, power loss
ar: عطل المضخة، كشف التسرب، انقطاع الطاقة

source: Water Level Alerts
ar: تنبيهات مستوى الماء

# waterLevelAlertsSub
source: Low water level, refilling required
ar: انخفاض مستوى الماء، يلزم إعادة التعبئة

source: Parameter Warnings
ar: تحذيرات المعايير

# parameterWarningsSub
source: pH or EC deviation outside safe range
ar: انحراف pH أو EC خارج النطاق الآمن

source: WiFi Setup
ar: إعداد الواي فاي

# helpLabel
source: Help
ar: مساعدة

# discoverStep
source: Discover
ar: اكتشاف

# networkStep
source: Network
ar: الشبكة

# finishStep
source: Finish
ar: إنهاء

source: Select Network
ar: اختر الشبكة

# scanningSubtitle
source: Scanning for nearby networks. Select your 2.4GHz home network.
ar: جارٍ البحث عن الشبكات القريبة. اختر شبكة 2.4GHz المنزلية.

# scanningForEsp32
source: Scanning for ESP32 module...
ar: جارٍ البحث عن وحدة ESP32...

source: Available Networks
ar: الشبكات المتاحة

source: Rescan for Networks
ar: إعادة البحث عن الشبكات

# askMeAboutHydroponic
source: Ask me about your hydroponic system!
ar: اسألني عن نظام الزراعة المائية الخاص بك!

source: Type your question...
ar: اكتب سؤالك...

# errorMessage
source: Error: {error}
ar: خطأ: {error}

source: Smart Controls
ar: أدوات التحكم الذكية

source: System Operation Mode
ar: وضع تشغيل النظام

source: Smart Auto
ar: تلقائي ذكي

source: Manual Override
ar: تحكم يدوي

source: Hardware Modules
ar: وحدات الأجهزة

source: Water Pump
ar: مضخة المياه

source: Ventilation Fan
ar: مروحة التهوية

source: Raise EC
ar: رفع الموصلية (EC)

source: Lower EC
ar: خفض الموصلية (EC)

source: Raise pH
ar: رفع الحموضة (pH)

source: Lower pH
ar: خفض الحموضة (pH)

source: UV Light
ar: إضاءة UV

source: Heat Gen
ar: مولد حرارة

# manualOverrideWarning
source: Manual override is active. You control all modules at your own risk. Switch to Smart Auto for system-managed operation.
ar: التحكم اليدوي نشط. أنت تتحكم في جميع الوحدات على مسؤوليتك الخاصة. قم بالتبديل إلى الوضع التلقائي الذكي للتشغيل المدار بواسطة النظام.

# smartAutoInfo
source: Smart Auto mode: System controls all modules automatically. Switch to Manual Override to take control.
ar: وضع التلقائي الذكي: يتحكم النظام في جميع الوحدات تلقائيًا. قم بالتبديل إلى التحكم اليدوي لتولي زمام الأمور.

# onStatus
source: ON
ar: تشغيل

# offStatus
source: OFF
ar: إيقاف

# alertCriticalTitle
source: 🚨 Critical: {label} Issue
ar: 🚨 حرج: مشكلة في {label}

# alertWarningTitle
source: ⚠️ Warning: {label} Issue
ar: ⚠️ تحذير: مشكلة في {label}

# alertBody
source: {label} is currently at {value}{unit}. Check system immediately.
ar: {label} حالياً عند {value}{unit}. تحقق من النظام فوراً.

# defaultDailyTip
source: Consistency is key to a healthy harvest.
ar: الاستمرارية هي مفتاح الحصاد الصحي.

# profileTitle
source: Profile
ar: الملف الشخصي

source: Personal Information
ar: المعلومات الشخصية

source: Display Name
ar: الاسم المعروض

source: No Name
ar: بدون اسم

source: No Email
ar: بدون بريد إلكتروني
